Repository: stephen-zeng/Teleport
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ · iOS %@
zh_hans: %1$@ · iOS %2$@

source: %lld pts
zh_hans: %lld 个点

source: `xcrun` is not guaranteed to be usable on a clean macOS install. If macOS reports missing developer tools, install them with `xcode-select --install`. If full Xcode is already installed but the active developer directory is wrong, run `sudo xcode-select -s /Applications/Xcode.app/Contents/Developer`, then launch Xcode once to finish setup.
zh_hans: 在全新 macOS 安装上，`xcrun` 不一定可用。如果 macOS 提示缺少开发者工具，请运行 `xcode-select --install` 安装。如果已安装完整 Xcode 但当前开发者目录不正确，请运行 `sudo xcode-select -s /Applications/Xcode.app/Contents/Developer`，然后启动一次 Xcode 以完成设置。

source: Actions
zh_hans: 操作

source: Add at least two waypoints before saving the route.
zh_hans: 保存路线前至少添加两个航点。

# Added stop %lld. The suggested route now has %lld point(s).
source: Added stop %1$lld. The suggested route now has %2$lld point(s).
zh_hans: 已添加第 %1$lld 个停靠点。建议路线现有 %2$lld 个点。

source: Added waypoint %lld.
zh_hans: 已添加第 %lld 个航点。

source: Administrator approval is required for physical-device simulation.
zh_hans: 真机模拟需要管理员授权。

source: Administrator approval was canceled before the macOS password prompt.
zh_hans: 在 macOS 密码提示出现前，管理员授权已取消。

source: Administrator approval was canceled. Physical-device location simulation did not start.
zh_hans: 管理员授权已取消。真机位置模拟未启动。

source: Administrator Password
zh_hans: 管理员密码

source: Advance every waypoint on a fixed clock regardless of GPX timestamps.
zh_hans: 无论 GPX 时间戳如何，都按固定时间间隔推进每个航点。

source: Apple location search is temporarily unavailable.
zh_hans: Apple 位置搜索暂时不可用。

source: Authorize
zh_hans: 授权

source: Authorize physical-device location simulation. Your password is handled by macOS and is not stored by Teleport.
zh_hans: 为真机位置模拟授权。你的密码由 macOS 处理，Teleport 不会存储该密码。

source: Before simulating location on a physical iPhone, confirm the device and host are ready.
zh_hans: 在为真机 iPhone 模拟位置之前，请确认设备和主机已准备就绪。

source: Cancel
zh_hans: 取消

source: Canceled route builder.
zh_hans: 已取消路线构建。

source: Candidate Location
zh_hans: 候选位置

source: Choose a name for the saved route.
zh_hans: 为已保存路线选择一个名称。

source: Choose a name for the saved location.
zh_hans: 为这个已保存位置命名。

source: Choose a physical device or simulator from the sidebar.
zh_hans: 请从侧边栏选择一个真机设备或模拟器。

source: Clear
zh_hans: 清除

source: Clear Route
zh_hans: 清除路线

source: Cleared simulated location on %@.
zh_hans: 已清除 %@ 上的模拟位置。

source: Cleared the loaded route preview.
zh_hans: 已清除已加载路线的预览。

source: Close
zh_hans: 关闭

source: Command failed with exit code %d.
zh_hans: 命令失败，退出代码为 %d。

source: Completed
zh_hans: 已完成

source: Completed route %@.
zh_hans: 已完成路线 %@。

source: Connect
zh_hans: 连接

source: Connect to a device before using the movement wheel.
zh_hans: 使用移动控制轮之前，请先连接设备。

source: Connect to an available device before starting route playback.
zh_hans: 开始路线回放前，请先连接可用设备。

source: Connected
zh_hans: 已连接

source: Connected to %@.
zh_hans: 已连接到 %@。

source: Connecting
zh_hans: 连接中

source: Connecting to %@...
zh_hans: 正在连接到 %@...

source: Connection
zh_hans: 连接

source: Continue
zh_hans: 继续

source: Convert segment distance into delay using a target speed. Best for planned routes with no timing data.
zh_hans: 按目标速度将路段距离换算为延迟。最适合没有时间数据的规划路线。

source: Copied
zh_hans: 已复制

source: Copied coordinates for %@.
zh_hans: 已复制 %@ 的坐标。

source: Copy Command
zh_hans: 复制命令

source: Copy coordinates
zh_hans: 复制坐标

source: Copy Install Command
zh_hans: 复制安装命令

source: Create Route
zh_hans: 创建路线

source: Current Location
zh_hans: 当前位置

source: Current Point
zh_hans: 当前点

source: Cycling
zh_hans: 骑行

source: Delete
zh_hans: 删除

source: Deleted saved route %@.
zh_hans: 已删除已保存路线 %@。

source: Deleted saved location %@.
zh_hans: 已删除已保存位置 %@。

source: Developer Tools
zh_hans: 开发者工具

source: Device helper Python: %@
zh_hans: 设备辅助程序 Python：%@

source: Devices
zh_hans: 设备

source: Discard Edit
zh_hans: 放弃编辑

source: Disconnect
zh_hans: 断开连接

source: Disconnected
zh_hans: 已断开

source: Disconnected and cleared simulated locations.
zh_hans: 已断开连接并清除模拟位置。

source: Disconnected from %@.
zh_hans: 已断开与 %@ 的连接。

source: Disconnecting
zh_hans: 断开中

source: Discovering
zh_hans: 发现中

source: Discovery
zh_hans: 发现

source: Distance
zh_hans: 距离

source: Don't show this again
zh_hans: 不再显示

source: Drag the control wheel to move the simulated point. Push farther to move faster, up to the configured speed. Release to stop.
zh_hans: 拖动控制轮以移动模拟点。推得越远，移动速度越快，最高可达设定速度。松开即可停止。

source: Drawn
zh_hans: 绘制

source: Driving
zh_hans: 驾车

source: Edit
zh_hans: 编辑

source: Editing is only available for user-created routes.
zh_hans: 仅用户创建的路线可编辑。

source: Editing saved route %@.
zh_hans: 正在编辑已保存路线 %@。

source: Enable Developer Mode on the iPhone in Settings > Privacy & Security > Developer Mode.
zh_hans: 请在 iPhone 的“设置 > 隐私与安全性 > 开发者模式”中启用开发者模式。

source: Enter a new name for this saved route.
zh_hans: 为这条已保存路线输入新名称。

source: Enter a new name for this saved location.
zh_hans: 为这个已保存位置输入新名称。

source: Enter valid coordinates before starting movement.
zh_hans: 开始移动前请输入有效坐标。

source: Enter valid coordinates.
zh_hans: 请输入有效坐标。

source: Export GPX
zh_hans: 导出 GPX

source: Exported %@ as GPX.
zh_hans: 已将 %@ 导出为 GPX。

source: Failed
zh_hans: 失败

source: Failed to clear the physical-device simulated location.
zh_hans: 无法清除真机的模拟位置。

source: Failed to export GPX: %@
zh_hans: 导出 GPX 失败：%@

source: Failed to get a navigation route: %@
zh_hans: 获取导航路线失败：%@

source: Failed to import GPX: %@
zh_hans: 导入 GPX 失败：%@

source: Failed to launch %@: %@
zh_hans: 无法启动 %1$@：%2$@

source: Failed to launch the physical-device helper: %@
zh_hans: 无法启动真机辅助程序：%@

source: Finding a navigation route between the selected stops.
zh_hans: 正在查找所选停靠点之间的导航路线。

source: Fix Command
zh_hans: 修复命令

source: Fixed
zh_hans: 固定

source: Fixed Interval
zh_hans: 固定间隔

source: For Wi-Fi discovery, connect once over USB first, accept pairing, then keep the iPhone unlocked on the same local network.
zh_hans: 要通过 Wi‑Fi 发现设备，请先通过 USB 连接一次并接受配对，然后保持 iPhone 解锁并连接到同一局域网。

source: Found %lld device(s).
zh_hans: 已找到 %lld 台设备。

source: Highway
zh_hans: 高速

source: Idle
zh_hans: 空闲

source: Import a GPX route or create one by adding waypoints on the map.
zh_hans: 导入 GPX 路线，或通过在地图上添加航点来创建路线。

source: Import GPX
zh_hans: 导入 GPX

source: Install Command
zh_hans: 安装命令

source: Install or Upgrade Command
zh_hans: 安装或升级命令

source: Install or Upgrade pymobiledevice3
zh_hans: 安装或升级 pymobiledevice3

source: Install or upgrade pymobiledevice3 5.0 or newer for the same Python interpreter used by the device helper. The command below is meant to run as your normal macOS user.
zh_hans: 请为设备辅助程序使用的同一个 Python 解释器安装或升级到 pymobiledevice3 5.0 或更高版本。下面的命令应以你当前的 macOS 普通用户身份运行。

source: Install or upgrade pymobiledevice3 for the selected Python interpreter to continue physical-device location simulation.
zh_hans: 请为所选 Python 解释器安装或升级 pymobiledevice3，以继续进行真机位置模拟。

source: Install pymobiledevice3
zh_hans: 安装 pymobiledevice3

source: Install pymobiledevice3 for the selected Python interpreter to continue physical-device location simulation.
zh_hans: 请为所选 Python 解释器安装 pymobiledevice3，以继续进行真机位置模拟。

source: Install pymobiledevice3 into the same Python interpreter used by the device helper.
zh_hans: 请将 pymobiledevice3 安装到设备辅助程序所使用的同一个 Python 解释器中。

source: Install Python 3 on this Mac so `python3` resolves from your shell.
zh_hans: 请在这台 Mac 上安装 Python 3，以便 shell 可以解析到 `python3`。

source: Install Xcode and open it once so Apple's developer tools finish setup and `xcrun` can access device and simulator tooling.
zh_hans: 请安装 Xcode 并启动一次，以便 Apple 的开发者工具完成设置，并让 `xcrun` 可以访问真机和模拟器工具。

source: Installed pymobiledevice3: %@
zh_hans: 已安装的 pymobiledevice3：%@

source: Installed Version
zh_hans: 已安装版本

source: Latest Leg
zh_hans: 最新路段

source: Latitude
zh_hans: 纬度

source: Load
zh_hans: 加载

source: Load a route before starting playback.
zh_hans: 开始回放前请先加载路线。

# Loaded route %@ with %lld point(s).
source: Loaded route %1$@ with %2$lld point(s).
zh_hans: 已加载路线 %1$@，共 %2$lld 个点。

source: Loaded saved route %@.
zh_hans: 已加载已保存路线 %@。

source: Loaded saved location %@.
zh_hans: 已加载已保存位置 %@。

source: Longitude
zh_hans: 经度

source: macOS will ask for your administrator password in a separate system dialog when the physical-device tunnel starts.
zh_hans: 当真机隧道启动时，macOS 会在单独的系统对话框中请求你的管理员密码。

source: Manual Coordinates
zh_hans: 手动坐标

source: Minimum supported pymobiledevice3: %@
zh_hans: 最低支持的 pymobiledevice3：%@

source: Minimum Supported Version
zh_hans: 最低支持版本

source: Missing Python dependency
zh_hans: 缺少 Python 依赖

source: Movement
zh_hans: 移动

source: Moving
zh_hans: 移动中

# Moving through %@ on %@.
source: Moving through %1$@ on %2$@.
zh_hans: 正在 %2$@ 上移动经过 %1$@。

source: Navigation
zh_hans: 导航

source: Navigation mode asks Apple Maps for a suggested road route between each tapped stop.
zh_hans: 导航模式会向 Apple 地图请求每两个已点按停靠点之间的推荐道路路线。

source: No saved locations yet.
zh_hans: 还没有已保存位置。

source: New Location
zh_hans: 新位置

source: No device selected
zh_hans: 未选择设备

source: No devices found.
zh_hans: 未找到设备。

source: No map result was returned for that place.
zh_hans: 该地点未返回地图结果。

source: No service available for %@.
zh_hans: 没有适用于 %@ 的服务。

source: Only the latest leg shows alternate routes to keep the builder compact. Undo to revise earlier legs.
zh_hans: 仅最新路段显示备选路线，以保持构建器简洁。若要修改较早的路段，请使用撤销。

source: Path Style
zh_hans: 路径样式

source: Pause
zh_hans: 暂停

source: Paused
zh_hans: 已暂停

source: Paused route %@.
zh_hans: 已暂停路线 %@。

source: Physical Device Setup
zh_hans: 真机设备设置

source: Physical Devices
zh_hans: 真机设备

source: Physical-device location simulation exited before reporting ready.
zh_hans: 真机位置模拟在报告就绪前已退出。

source: Physical-device simulation needs pymobiledevice3 5.0 or newer in the exact Python interpreter selected for the helper. Run the fix command as your normal macOS user so Teleport can reuse that package path after administrator approval.
zh_hans: 真机模拟要求在为辅助程序选定的那个 Python 解释器中安装 pymobiledevice3 5.0 或更高版本。请以你当前的 macOS 普通用户身份运行修复命令，这样 Teleport 才能在获得管理员授权后复用该包路径。

source: Physical-device simulation needs pymobiledevice3 in the exact Python interpreter selected for the helper.
zh_hans: 真机位置模拟需要在辅助程序所选的确切 Python 解释器中安装 pymobiledevice3。

source: Physical-device simulation requires pymobiledevice3 %@ or newer.
zh_hans: 真机模拟需要 pymobiledevice3 %@ 或更高版本。

source: Play
zh_hans: 播放

source: Playback
zh_hans: 回放

source: Playing
zh_hans: 播放中

# Playing route %@ · point %lld of %lld.
source: Playing route %1$@ · point %2$lld of %3$lld.
zh_hans: 正在播放路线 %1$@ · 第 %2$lld / %3$lld 个点。

source: Points
zh_hans: 点

source: Progress
zh_hans: 进度

source: pymobiledevice3 is missing for the Python executable used by physical-device simulation.
zh_hans: 用于真机位置模拟的 Python 可执行文件缺少 pymobiledevice3。

source: pymobiledevice3 is not installed for the Python executable used by physical-device simulation.
zh_hans: 用于真机模拟的那个 Python 可执行文件尚未安装 pymobiledevice3。

source: Python dependency issue
zh_hans: Python 依赖问题

source: python3 is not currently resolving from your shell. Install Python 3 first, then refresh devices.
zh_hans: 当前无法从你的 shell 解析到 python3。请先安装 Python 3，然后刷新设备。

source: Ready
zh_hans: 就绪

source: Ready to discover simulators and physical devices.
zh_hans: 准备好发现模拟器和真机设备。

source: Recent Searches
zh_hans: 最近搜索

source: Recorded
zh_hans: 记录

source: Recorded Time
zh_hans: 记录时长

source: Refresh Devices
zh_hans: 刷新设备

source: Remove from recent searches
zh_hans: 从最近搜索中移除

source: Rename
zh_hans: 重命名

source: Rename Saved Route
zh_hans: 重命名已保存路线

source: Rename Saved Location
zh_hans: 重命名已保存位置

source: Renamed saved route to %@.
zh_hans: 已将已保存路线重命名为 %@。

source: Renamed saved location to %@.
zh_hans: 已将已保存位置重命名为 %@。

source: Replay
zh_hans: 重播

source: Replay Speed
zh_hans: 回放速度

source: Replay Time
zh_hans: 回放时长

source: Resolved Python
zh_hans: 已解析的 Python

source: Resolved Python: %@
zh_hans: 已解析的 Python：%@

source: Resolved python3 to %@, but that file is not executable.
zh_hans: python3 已解析为 %@，但该文件不可执行。

source: Resume
zh_hans: 继续

source: Review the administrator approval note to continue with physical-device location simulation.
zh_hans: 请先查看管理员授权说明，再继续进行真机位置模拟。

source: Route
zh_hans: 路线

source: Route builder is active. Tap the map to add waypoints.
zh_hans: 路线构建器已启用。点按地图以添加航点。

source: Route builder now has %lld waypoint(s).
zh_hans: 路线构建器现有 %lld 个航点。

source: Route End
zh_hans: 路线终点

source: Route Start
zh_hans: 路线起点

source: Run the command in Terminal as your normal macOS user, then return here and retry the physical-device location action.
zh_hans: 请以你当前的 macOS 普通用户身份在终端中运行该命令，然后返回此处重试真机位置操作。

source: Run the command in Terminal as your normal macOS user if needed, then continue. You can copy it directly from this sheet.
zh_hans: 如有需要，请以你当前的 macOS 普通用户身份在终端中运行该命令，然后继续。你可以直接从此面板复制该命令。

source: Run the command in Terminal, then return here and retry the physical-device location action.
zh_hans: 请在终端中运行该命令，然后返回这里重试真机位置操作。

source: Run the install command in Terminal if needed, then continue. You can copy the command directly from this sheet.
zh_hans: 如有需要，请先在终端中运行安装命令，然后继续。你可以直接从此面板复制该命令。

source: Run: %@
zh_hans: 运行：%@

source: Save
zh_hans: 保存

source: Save As New
zh_hans: 另存为新路线

source: Save in App
zh_hans: 保存在应用中

source: Save Route in App
zh_hans: 在应用中保存路线

source: Save Location
zh_hans: 保存位置

source: Saved %@ as a new route.
zh_hans: 已将 %@ 保存为新路线。

source: Saved %@ in the app.
zh_hans: 已将 %@ 保存在应用中。

source: Saved location %@.
zh_hans: 已保存位置 %@。

source: Saved Locations
zh_hans: 已保存位置

source: Saved Routes
zh_hans: 已保存路线

source: Scanning for simulator and physical devices...
zh_hans: 正在扫描模拟器和真机设备...

source: Search for a place or address
zh_hans: 搜索地点或地址

source: Select a device first.
zh_hans: 请先选择一个设备。

source: Select a device to begin
zh_hans: 请选择一个设备以开始

source: Select a physical device to resolve the helper Python interpreter.
zh_hans: 请选择一个真机设备以解析辅助程序所用的 Python 解释器。

source: Selected Place
zh_hans: 选定地点

# Selected route option %lld of %lld for the latest leg.
source: Selected route option %1$lld of %2$lld for the latest leg.
zh_hans: 已为最新路段选择第 %1$lld 个路线选项，共 %2$lld 个。

source: Session
zh_hans: 会话

source: Session Log
zh_hans: 会话日志

source: Show All
zh_hans: 全部显示

source: Show Less
zh_hans: 收起

source: Simulate
zh_hans: 模拟

source: Simulated Location
zh_hans: 模拟位置

source: Simulating %@ on %@.
zh_hans: 正在 %2$@ 上模拟 %1$@。

source: Simulation
zh_hans: 模拟

source: Simulator
zh_hans: 模拟器

source: Simulators
zh_hans: 模拟器

source: Source
zh_hans: 来源

source: Speed
zh_hans: 速度

source: Start simulation on the physical device before using the movement wheel.
zh_hans: 使用移动控制轮之前，请先在真机设备上启动模拟。

source: Starting
zh_hans: 启动中

source: Starting physical-device location simulation. This can take a moment while Teleport connects to the device and prepares the helper.
zh_hans: 正在启动真机位置模拟。Teleport 需要一点时间来连接设备并准备辅助程序。

source: Starting physical-device simulation
zh_hans: 正在启动真机模拟

source: Status
zh_hans: 状态

source: Stop
zh_hans: 停止

source: Stopped route %@.
zh_hans: 已停止路线 %@。

source: Stopping
zh_hans: 停止中

source: Stops
zh_hans: 停靠点

source: Straight
zh_hans: 直线

source: Tap the map to add waypoints. Then replay the route with a fixed interval or travel speed.
zh_hans: 点按地图以添加航点。随后可按固定间隔或行进速度回放路线。

source: Tap the map to append waypoints to this saved route. Update to overwrite, or Save As New to branch it.
zh_hans: 点按地图以向这条已保存路线追加航点。选择“更新已保存路线”以覆盖，或选择“另存为新路线”以创建分支。

source: Teleport is connecting to the device and preparing the helper.
zh_hans: Teleport 正在连接设备并准备辅助程序。

source: Teleport requires administrator privileges for physical-device location simulation.
zh_hans: Teleport 需要管理员权限才能进行真机位置模拟。

source: The administrator password was incorrect. Check the password and try again.
zh_hans: 管理员密码不正确。请检查密码后重试。

source: The installed pymobiledevice3 version is too old for physical-device simulation.
zh_hans: 已安装的 pymobiledevice3 版本过旧，无法用于真机模拟。

source: The loaded route needs at least two points for playback.
zh_hans: 已加载的路线至少需要两个点才能回放。

source: The movement wheel is available for connected simulators and for physical devices after simulation has started.
zh_hans: 移动控制轮适用于已连接的模拟器，以及已启动模拟后的真机设备。

source: The physical-device helper reported an invalid startup state.
zh_hans: 真机辅助程序报告了无效的启动状态。

source: The route builder is empty.
zh_hans: 路线构建器为空。

source: The selected physical device is not currently reachable.
zh_hans: 所选真机设备当前不可达。

source: Then retry the physical-device location action.
zh_hans: 然后重试真机位置操作。

source: Timed out while waiting for the physical-device helper to start location simulation.
zh_hans: 等待真机辅助程序启动位置模拟超时。

source: Timing
zh_hans: 时序

source: Travel Mode
zh_hans: 出行方式

source: Travel Speed
zh_hans: 行进速度

source: Unable to load that location from Apple Maps right now.
zh_hans: 当前无法从 Apple 地图加载该位置。

source: Unable to resolve python3 from %@.
zh_hans: 无法从 %@ 解析 python3。

source: Undo
zh_hans: 撤销

source: Update Interval
zh_hans: 更新间隔

source: Update Saved
zh_hans: 更新已保存路线

source: Updated saved route %@.
zh_hans: 已更新已保存路线 %@。

source: USB · unavailable
zh_hans: USB · 不可用

source: USB Device
zh_hans: USB 设备

source: Use GPX timing when present, but compress long pauses for practical replay.
zh_hans: 如果 GPX 提供了时间信息则优先使用，但会压缩较长停顿以便实际回放。

source: Wait for the current navigation segment to finish loading.
zh_hans: 请等待当前导航路段加载完成。

source: Walking
zh_hans: 步行

source: Waypoint Route
zh_hans: 航点路线

source: Wi-Fi · unavailable
zh_hans: Wi‑Fi · 不可用

source: Wi-Fi Device
zh_hans: Wi‑Fi 设备

source: Your password is requested in a separate macOS dialog. Teleport does not store, display, or reuse that password.
zh_hans: 你的密码将在单独的 macOS 对话框中请求。Teleport 不会存储、显示或重复使用该密码。
